//для любознательных: Написать программу премножения любых целых чисел


long num1 = 1000456321;
long num2 = 90329434;
long result = num1 * num2;

Console.WriteLine(result);